---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Erase(Autodesk.Revit.DB.Electrical.GroundConductorSize)
source: html/4c1b96f7-5ec8-a525-d5b4-bf3c397a33c7.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Erase Method

Removes a specified GroundConductorSize from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	GroundConductorSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.GroundConductorSize`) - The GroundConductorSize to be erased.

## Returns
The number of GroundConductorSizes that were erased from the set.